# Завдання 1
# Напишіть чат бота, який імітує замовлення піци. Чат бот
# має бути ввічливим. Реалізуйте функціонал:
# 1. Показати меню
# 2. Задати питання
# 3. Зробити замовлення
# 4. Змінити замовлення
# 5. Підтвердити замовлення(бот має показати суму замовлення)

# Меню:
# 1. Маргарита
# Томатний соус, моцарела, базилік
# 2. Пепероні
# Томатний соус, моцарела, пепероні
# 3. 4 сири
# Моцарела, дорблю, пармезан, чеддер
# 4. Гавайська
# Томатний соус, моцарела, шинка, ананас
# 5. Вегетаріанська
# Томатний соус, моцарела, болгарський перець, гриби, оливки,
# кукурудза
#
# Назва Мала (25 см) Велика (35 см)
# Маргарита 120 грн 180 грн
# Пепероні 140 грн 200 грн
# 4 сири 160 грн 220 грн
# Гавайська 150 грн 210 грн
# Вегетаріанська 130 грн 190 грн

# _____________________________________________________________________________
from langchain_google_genai import ChatGoogleGenerativeAI
from langchain.prompts import PromptTemplate
from langchain_core.messages import (
    HumanMessage,
    AIMessage,
    SystemMessage,
    trim_messages
)

import json
import dotenv
import os

# завантажити api ключі з папки .env
dotenv.load_dotenv()

# отримати сам ключ
api_key = os.getenv('GEMINI_API_KEY')

# створення чат моделі
# Велика мовна модель(llm)

llm = ChatGoogleGenerativeAI(
    model='gemini-2.0-flash',  # назва моделі
    google_api_key=api_key,    # ваша API
    temperature=0.1  # ваша API

)
#_____________________________________________________________________________

messages = [
    SystemMessage("""
    Ти — чемний помічник з допомоги у виборі та оформлення замовлення піци в нашій піцерії "Папероні".
    Твоя задача допомогти клієнту вибрати піцу, оформити замовлення та передати його до пекаря.
    
    Твій функціонал та алгоритм дій наступний: 
        1. Привітатись та зясувати як звати клієнта.
        2. Ознайомити клієнта з меню, яке знаходиться в промті нижче.
        3. Зясувати смаки клієнта, його потребу (на яку кількість людей потрібно піци (скільки штук та їх розміри) і 
        запропонувати піцу (піци) на вибір.
        4. Оформити замовлення зясувавши адресу доставки, контактну особу та її номер телефону.
        5. Підтвердити замовлення (маєш показати суму замовлення)
        6. При необхідності - змінити замовлення та повторно виконати пункт 5 алгоритму.
        При необхідності ти можеш відступати від вказаного вище алгоритму дій.
    
    Меню:
        1. Маргарита
        Томатний соус, моцарела, базилік
        2. Пепероні
        Томатний соус, моцарела, пепероні
        3. 4 сири
        Моцарела, дорблю, пармезан, чеддер
        4. Гавайська
        Томатний соус, моцарела, шинка, ананас
        5. Вегетаріанська
        Томатний соус, моцарела, болгарський перець, гриби, оливки,
        кукурудза

    Вартість:
        Назва Мала (25 см) Велика (35 см)
        Маргарита 120 грн 180 грн
        Пепероні 140 грн 200 грн
        4 сири 160 грн 220 грн
        Гавайська 150 грн 210 грн
        Вегетаріанська 130 грн 190 грн
    """)

]

while True:
    message = input("Ви: ")

    if message == '':
        break

    human_mes = HumanMessage(message)

    messages.append(human_mes)

    response = llm.invoke(messages)

    messages.append(response)

    print(response.content)